window.HUNAN_HYDRO_DATA = {
  "generated": "2026-10-10 09:07:57",
  "stats": {
    "reservoirs": 5,
    "river_stations": 23,
    "basins": 5
  },
  "reservoirs": {
    "东江": {
      "name": "东江",
      "stcd": "61108050",
      "basin": "湘江",
      "capacity_mw": 500,
      "rz": 280.72,
      "inq": 55.0,
      "otq": 194.0,
      "rwptn": "4",
      "fsltdz": null,
      "laz": 268.0,
      "hhrz": 285.4,
      "w": 7457.7,
      "tm": "2026-10-10 08:00:00",
      "comments": "大型"
    },
    "柘溪": {
      "name": "柘溪",
      "stcd": "61201300",
      "basin": "资水",
      "capacity_mw": 1040,
      "rz": 165.18,
      "inq": 467.0,
      "otq": 313.0,
      "rwptn": "4",
      "fsltdz": null,
      "laz": 145.8,
      "hhrz": 172.73,
      "w": 2421.6,
      "tm": "2026-10-10 08:00:00",
      "comments": "大型"
    },
    "五强溪": {
      "name": "五强溪",
      "stcd": "61302350",
      "basin": "沅水",
      "capacity_mw": 1200,
      "rz": 103.49,
      "inq": 100.0,
      "otq": 3006.285,
      "rwptn": null,
      "fsltdz": null,
      "laz": 93.0,
      "hhrz": 113.26,
      "w": 2365.2,
      "tm": "2026-10-10 08:00:00",
      "comments": "大型"
    },
    "凤滩": {
      "name": "凤滩",
      "stcd": "61312550",
      "basin": "沅水",
      "capacity_mw": 815,
      "rz": 194.93,
      "inq": 515.0,
      "otq": 290.0,
      "rwptn": "5",
      "fsltdz": null,
      "laz": 180.0,
      "hhrz": 206.11,
      "w": 983.6,
      "tm": "2026-10-10 08:00:00",
      "comments": "大型"
    },
    "江垭": {
      "name": "江垭",
      "stcd": "61401900",
      "basin": "澧水",
      "capacity_mw": 300,
      "rz": 220.86,
      "inq": 84.12,
      "otq": 0.0,
      "rwptn": null,
      "fsltdz": null,
      "laz": 200.5,
      "hhrz": 235.99,
      "w": 1128.522,
      "tm": "2026-10-10 08:00:00",
      "comments": "大型"
    }
  },
  "rivers": {
    "黔城": {
      "name": "黔城",
      "stcd": "61300800",
      "z": 189.83,
      "q": null,
      "bjj": -3.17,
      "wrz": 193.0,
      "wptn": "5",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-10-10 08:40:00",
      "adnm": "洪江市"
    },
    "老埠头": {
      "name": "老埠头",
      "stcd": "61100900",
      "z": 99.791,
      "q": 872.0,
      "bjj": -3.209,
      "wrz": 103.0,
      "wptn": "4",
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-10-10 08:50:00",
      "adnm": "零陵区"
    },
    "衡阳": {
      "name": "衡阳",
      "stcd": "61101400",
      "z": 52.5,
      "q": 710.0,
      "bjj": -4.0,
      "wrz": 56.5,
      "wptn": null,
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-10-10 08:37:00",
      "adnm": "石鼓区"
    },
    "长沙(三)": {
      "name": "长沙(三)",
      "stcd": "61102200",
      "z": 31.81,
      "q": null,
      "bjj": -4.19,
      "wrz": 36.0,
      "wptn": null,
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-10-10 08:05:00",
      "adnm": "天心区"
    },
    "邵阳": {
      "name": "邵阳",
      "stcd": "61200600",
      "z": 209.4,
      "q": null,
      "bjj": -4.6,
      "wrz": 214.0,
      "wptn": "4",
      "hnnm": "资水",
      "rvnm": "资水",
      "tm": "2026-10-10 08:50:00",
      "adnm": "大祥区"
    },
    "沅江(二)": {
      "name": "沅江(二)",
      "stcd": "61508400",
      "z": 28.76,
      "q": null,
      "bjj": -4.74,
      "wrz": 33.5,
      "wptn": "6",
      "hnnm": "洞庭湖",
      "rvnm": "万子湖",
      "tm": "2026-10-10 08:00:00",
      "adnm": "沅江市"
    },
    "归阳": {
      "name": "归阳",
      "stcd": "61101200",
      "z": 40.5,
      "q": 524.0,
      "bjj": -5.0,
      "wrz": 45.5,
      "wptn": null,
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-10-10 08:50:00",
      "adnm": "祁东县"
    },
    "新化": {
      "name": "新化",
      "stcd": "61200900",
      "z": 165.14,
      "q": 1430.0,
      "bjj": -5.08,
      "wrz": 170.22,
      "wptn": "5",
      "hnnm": "资水",
      "rvnm": "资水",
      "tm": "2026-10-10 08:15:00",
      "adnm": "新化县"
    },
    "小河咀": {
      "name": "小河咀",
      "stcd": "61507800",
      "z": 28.75,
      "q": 1670.0,
      "bjj": -5.25,
      "wrz": 34.0,
      "wptn": "6",
      "hnnm": "洞庭湖",
      "rvnm": "西洞庭湖湖口(南端)",
      "tm": "2026-10-10 08:00:00",
      "adnm": "沅江市"
    },
    "南咀": {
      "name": "南咀",
      "stcd": "61507600",
      "z": 28.66,
      "q": 690.0,
      "bjj": -5.34,
      "wrz": 34.0,
      "wptn": "5",
      "hnnm": "洞庭湖",
      "rvnm": "西洞庭湖湖口(北端)",
      "tm": "2026-10-10 08:00:00",
      "adnm": "沅江市"
    },
    "衡山(二)": {
      "name": "衡山(二)",
      "stcd": "61101600",
      "z": 43.04,
      "q": 1390.0,
      "bjj": -5.96,
      "wrz": 49.0,
      "wptn": null,
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-10-10 08:47:00",
      "adnm": "衡山县"
    },
    "桃江(二)": {
      "name": "桃江(二)",
      "stcd": "61202100",
      "z": 33.17,
      "q": 512.0,
      "bjj": -6.03,
      "wrz": 39.2,
      "wptn": "4",
      "hnnm": "资水",
      "rvnm": "资水",
      "tm": "2026-10-10 08:50:00",
      "adnm": "桃江县"
    },
    "湘潭": {
      "name": "湘潭",
      "stcd": "61102000",
      "z": 31.81,
      "q": 1706.795,
      "bjj": -6.19,
      "wrz": 38.0,
      "wptn": "5",
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-10-10 08:30:00",
      "adnm": "雨湖区"
    },
    "张家界": {
      "name": "张家界",
      "stcd": "61400400",
      "z": 156.64,
      "q": null,
      "bjj": -6.36,
      "wrz": 163.0,
      "wptn": "5",
      "hnnm": "澧水",
      "rvnm": "澧水",
      "tm": "2026-10-10 08:50:00",
      "adnm": "永定区"
    },
    "石门": {
      "name": "石门",
      "stcd": "61400900",
      "z": 50.78,
      "q": 176.0,
      "bjj": -7.72,
      "wrz": 58.5,
      "wptn": "6",
      "hnnm": "澧水",
      "rvnm": "澧水",
      "tm": "2026-10-10 08:00:00",
      "adnm": "石门县"
    },
    "株洲": {
      "name": "株洲",
      "stcd": "61101900",
      "z": 31.81,
      "q": 1710.0,
      "bjj": -8.19,
      "wrz": 40.0,
      "wptn": "6",
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-10-10 08:00:00",
      "adnm": "芦淞区"
    },
    "辰溪": {
      "name": "辰溪",
      "stcd": "61301500",
      "z": 111.19,
      "q": 702.0,
      "bjj": -8.81,
      "wrz": 120.0,
      "wptn": "6",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-10-10 08:00:00",
      "adnm": "辰溪县"
    },
    "安江": {
      "name": "安江",
      "stcd": "61301200",
      "z": 153.96,
      "q": 776.0,
      "bjj": -9.04,
      "wrz": 163.0,
      "wptn": "6",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-10-10 08:50:00",
      "adnm": "洪江市"
    },
    "桃源": {
      "name": "桃源",
      "stcd": "61302800",
      "z": 32.78,
      "q": 2660.0,
      "bjj": -9.72,
      "wrz": 42.5,
      "wptn": "5",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-10-10 08:50:00",
      "adnm": "桃源县"
    },
    "岳阳": {
      "name": "岳阳",
      "stcd": "61511900",
      "z": 22.7,
      "q": null,
      "bjj": -9.8,
      "wrz": 32.5,
      "wptn": "4",
      "hnnm": "洞庭湖",
      "rvnm": "洞庭湖湖口",
      "tm": "2026-10-10 08:00:00",
      "adnm": ""
    },
    "城陵矶(七里山)": {
      "name": "城陵矶(七里山)",
      "stcd": "61512000",
      "z": 22.68,
      "q": 4730.0,
      "bjj": -10.32,
      "wrz": 33.0,
      "wptn": "6",
      "hnnm": "洞庭湖",
      "rvnm": "洞庭湖湖口",
      "tm": "2026-10-10 08:00:00",
      "adnm": "岳阳楼区"
    },
    "浦市(二)": {
      "name": "浦市(二)",
      "stcd": "61301600",
      "z": 109.1,
      "q": 884.0,
      "bjj": -10.36,
      "wrz": 119.46,
      "wptn": "6",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-10-10 08:50:00",
      "adnm": "泸溪县"
    },
    "津市(二)": {
      "name": "津市(二)",
      "stcd": "61401300",
      "z": 30.32,
      "q": null,
      "bjj": -10.68,
      "wrz": 41.0,
      "wptn": "4",
      "hnnm": "澧水",
      "rvnm": "澧水",
      "tm": "2026-10-10 08:25:00",
      "adnm": "津市市"
    }
  },
  "basins": {
    "沅江": {
      "avg_bjj": -8.22,
      "stations": [
        {
          "name": "黔城",
          "z": 189.83,
          "q": null,
          "bjj": -3.17,
          "wptn": "5"
        },
        {
          "name": "辰溪",
          "z": 111.19,
          "q": 702.0,
          "bjj": -8.81,
          "wptn": "6"
        },
        {
          "name": "安江",
          "z": 153.96,
          "q": 776.0,
          "bjj": -9.04,
          "wptn": "6"
        },
        {
          "name": "桃源",
          "z": 32.78,
          "q": 2660.0,
          "bjj": -9.72,
          "wptn": "5"
        },
        {
          "name": "浦市(二)",
          "z": 109.1,
          "q": 884.0,
          "bjj": -10.36,
          "wptn": "6"
        }
      ],
      "station_count": 5
    },
    "湘江": {
      "avg_bjj": -5.25,
      "stations": [
        {
          "name": "老埠头",
          "z": 99.791,
          "q": 872.0,
          "bjj": -3.209,
          "wptn": "4"
        },
        {
          "name": "衡阳",
          "z": 52.5,
          "q": 710.0,
          "bjj": -4.0,
          "wptn": null
        },
        {
          "name": "长沙(三)",
          "z": 31.81,
          "q": null,
          "bjj": -4.19,
          "wptn": null
        },
        {
          "name": "归阳",
          "z": 40.5,
          "q": 524.0,
          "bjj": -5.0,
          "wptn": null
        },
        {
          "name": "衡山(二)",
          "z": 43.04,
          "q": 1390.0,
          "bjj": -5.96,
          "wptn": null
        },
        {
          "name": "湘潭",
          "z": 31.81,
          "q": 1706.795,
          "bjj": -6.19,
          "wptn": "5"
        },
        {
          "name": "株洲",
          "z": 31.81,
          "q": 1710.0,
          "bjj": -8.19,
          "wptn": "6"
        }
      ],
      "station_count": 7
    },
    "资水": {
      "avg_bjj": -5.24,
      "stations": [
        {
          "name": "邵阳",
          "z": 209.4,
          "q": null,
          "bjj": -4.6,
          "wptn": "4"
        },
        {
          "name": "新化",
          "z": 165.14,
          "q": 1430.0,
          "bjj": -5.08,
          "wptn": "5"
        },
        {
          "name": "桃江(二)",
          "z": 33.17,
          "q": 512.0,
          "bjj": -6.03,
          "wptn": "4"
        }
      ],
      "station_count": 3
    },
    "洞庭湖": {
      "avg_bjj": -7.09,
      "stations": [
        {
          "name": "沅江(二)",
          "z": 28.76,
          "q": null,
          "bjj": -4.74,
          "wptn": "6"
        },
        {
          "name": "小河咀",
          "z": 28.75,
          "q": 1670.0,
          "bjj": -5.25,
          "wptn": "6"
        },
        {
          "name": "南咀",
          "z": 28.66,
          "q": 690.0,
          "bjj": -5.34,
          "wptn": "5"
        },
        {
          "name": "岳阳",
          "z": 22.7,
          "q": null,
          "bjj": -9.8,
          "wptn": "4"
        },
        {
          "name": "城陵矶(七里山)",
          "z": 22.68,
          "q": 4730.0,
          "bjj": -10.32,
          "wptn": "6"
        }
      ],
      "station_count": 5
    },
    "澧水": {
      "avg_bjj": -8.25,
      "stations": [
        {
          "name": "张家界",
          "z": 156.64,
          "q": null,
          "bjj": -6.36,
          "wptn": "5"
        },
        {
          "name": "石门",
          "z": 50.78,
          "q": 176.0,
          "bjj": -7.72,
          "wptn": "6"
        },
        {
          "name": "津市(二)",
          "z": 30.32,
          "q": null,
          "bjj": -10.68,
          "wptn": "4"
        }
      ],
      "station_count": 3
    }
  }
};
