window.HUNAN_HYDRO_DATA = {
  "generated": "2026-09-15 09:04:43",
  "stats": {
    "reservoirs": 5,
    "river_stations": 23,
    "basins": 5
  },
  "reservoirs": {
    "东江": {
      "name": "东江",
      "stcd": "61108050",
      "basin": "湘江",
      "capacity_mw": 500,
      "rz": 282.25,
      "inq": 193.0,
      "otq": 336.0,
      "rwptn": "4",
      "fsltdz": 285.0,
      "laz": 268.0,
      "hhrz": 285.4,
      "w": 7690.65,
      "tm": "2026-09-15 08:00:00",
      "comments": "大型"
    },
    "柘溪": {
      "name": "柘溪",
      "stcd": "61201300",
      "basin": "资水",
      "capacity_mw": 1040,
      "rz": 165.49,
      "inq": 421.0,
      "otq": 720.0,
      "rwptn": "4",
      "fsltdz": 169.0,
      "laz": 145.8,
      "hhrz": 172.73,
      "w": 2458.8,
      "tm": "2026-09-15 08:00:00",
      "comments": "大型"
    },
    "五强溪": {
      "name": "五强溪",
      "stcd": "61302350",
      "basin": "沅水",
      "capacity_mw": 1200,
      "rz": 100.01,
      "inq": 503.2,
      "otq": 2313.062,
      "rwptn": null,
      "fsltdz": 108.0,
      "laz": 93.0,
      "hhrz": 113.26,
      "w": 1918.3,
      "tm": "2026-09-15 08:00:00",
      "comments": "大型"
    },
    "凤滩": {
      "name": "凤滩",
      "stcd": "61312550",
      "basin": "沅水",
      "capacity_mw": 815,
      "rz": 192.72,
      "inq": 178.0,
      "otq": 271.0,
      "rwptn": "4",
      "fsltdz": 205.0,
      "laz": 180.0,
      "hhrz": 206.11,
      "w": 909.8,
      "tm": "2026-09-15 08:00:00",
      "comments": "大型"
    },
    "江垭": {
      "name": "江垭",
      "stcd": "61401900",
      "basin": "澧水",
      "capacity_mw": 300,
      "rz": 216.59,
      "inq": 69.21,
      "otq": 85.81,
      "rwptn": null,
      "fsltdz": 236.0,
      "laz": 200.5,
      "hhrz": 235.99,
      "w": 1004.617,
      "tm": "2026-09-15 08:00:00",
      "comments": "大型"
    }
  },
  "rivers": {
    "老埠头": {
      "name": "老埠头",
      "stcd": "61100900",
      "z": 99.93,
      "q": 1020.0,
      "bjj": -3.07,
      "wrz": 103.0,
      "wptn": "6",
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-09-15 08:00:00",
      "adnm": "零陵区"
    },
    "黔城": {
      "name": "黔城",
      "stcd": "61300800",
      "z": 189.45,
      "q": null,
      "bjj": -3.55,
      "wrz": 193.0,
      "wptn": "6",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-09-15 08:00:00",
      "adnm": "洪江市"
    },
    "衡阳": {
      "name": "衡阳",
      "stcd": "61101400",
      "z": 52.66,
      "q": null,
      "bjj": -3.84,
      "wrz": 56.5,
      "wptn": null,
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-09-15 08:47:00",
      "adnm": "石鼓区"
    },
    "长沙(三)": {
      "name": "长沙(三)",
      "stcd": "61102200",
      "z": 31.93,
      "q": null,
      "bjj": -4.07,
      "wrz": 36.0,
      "wptn": "5",
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-09-15 08:00:00",
      "adnm": "天心区"
    },
    "邵阳": {
      "name": "邵阳",
      "stcd": "61200600",
      "z": 209.64,
      "q": null,
      "bjj": -4.36,
      "wrz": 214.0,
      "wptn": "5",
      "hnnm": "资水",
      "rvnm": "资水",
      "tm": "2026-09-15 08:15:00",
      "adnm": "大祥区"
    },
    "归阳": {
      "name": "归阳",
      "stcd": "61101200",
      "z": 40.65,
      "q": null,
      "bjj": -4.85,
      "wrz": 45.5,
      "wptn": null,
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-09-15 08:45:00",
      "adnm": "祁东县"
    },
    "新化": {
      "name": "新化",
      "stcd": "61200900",
      "z": 165.37,
      "q": 1560.0,
      "bjj": -4.85,
      "wrz": 170.22,
      "wptn": "4",
      "hnnm": "资水",
      "rvnm": "资水",
      "tm": "2026-09-15 08:00:00",
      "adnm": "新化县"
    },
    "沅江(二)": {
      "name": "沅江(二)",
      "stcd": "61508400",
      "z": 28.58,
      "q": null,
      "bjj": -4.92,
      "wrz": 33.5,
      "wptn": "6",
      "hnnm": "洞庭湖",
      "rvnm": "万子湖",
      "tm": "2026-09-15 08:00:00",
      "adnm": "沅江市"
    },
    "小河咀": {
      "name": "小河咀",
      "stcd": "61507800",
      "z": 28.54,
      "q": 1430.0,
      "bjj": -5.46,
      "wrz": 34.0,
      "wptn": "5",
      "hnnm": "洞庭湖",
      "rvnm": "西洞庭湖湖口(南端)",
      "tm": "2026-09-15 08:00:00",
      "adnm": "沅江市"
    },
    "南咀": {
      "name": "南咀",
      "stcd": "61507600",
      "z": 28.43,
      "q": 613.0,
      "bjj": -5.57,
      "wrz": 34.0,
      "wptn": "6",
      "hnnm": "洞庭湖",
      "rvnm": "西洞庭湖湖口(北端)",
      "tm": "2026-09-15 08:00:00",
      "adnm": "沅江市"
    },
    "桃江(二)": {
      "name": "桃江(二)",
      "stcd": "61202100",
      "z": 33.43,
      "q": null,
      "bjj": -5.77,
      "wrz": 39.2,
      "wptn": "5",
      "hnnm": "资水",
      "rvnm": "资水",
      "tm": "2026-09-15 08:40:00",
      "adnm": "桃江县"
    },
    "湘潭": {
      "name": "湘潭",
      "stcd": "61102000",
      "z": 32.01,
      "q": 2530.0,
      "bjj": -5.99,
      "wrz": 38.0,
      "wptn": "6",
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-09-15 08:00:00",
      "adnm": "雨湖区"
    },
    "张家界": {
      "name": "张家界",
      "stcd": "61400400",
      "z": 156.74,
      "q": 40.0,
      "bjj": -6.26,
      "wrz": 163.0,
      "wptn": "6",
      "hnnm": "澧水",
      "rvnm": "澧水",
      "tm": "2026-09-15 08:00:00",
      "adnm": "永定区"
    },
    "衡山(二)": {
      "name": "衡山(二)",
      "stcd": "61101600",
      "z": 42.7,
      "q": null,
      "bjj": -6.3,
      "wrz": 49.0,
      "wptn": null,
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-09-15 08:47:00",
      "adnm": "衡山县"
    },
    "株洲": {
      "name": "株洲",
      "stcd": "61101900",
      "z": 32.2,
      "q": 2140.0,
      "bjj": -7.8,
      "wrz": 40.0,
      "wptn": "6",
      "hnnm": "湘江",
      "rvnm": "湘江",
      "tm": "2026-09-15 08:00:00",
      "adnm": "芦淞区"
    },
    "石门": {
      "name": "石门",
      "stcd": "61400900",
      "z": 50.66,
      "q": 135.0,
      "bjj": -7.84,
      "wrz": 58.5,
      "wptn": "6",
      "hnnm": "澧水",
      "rvnm": "澧水",
      "tm": "2026-09-15 08:00:00",
      "adnm": "石门县"
    },
    "岳阳": {
      "name": "岳阳",
      "stcd": "61511900",
      "z": 23.93,
      "q": null,
      "bjj": -8.57,
      "wrz": 32.5,
      "wptn": "4",
      "hnnm": "洞庭湖",
      "rvnm": "洞庭湖湖口",
      "tm": "2026-09-15 08:00:00",
      "adnm": ""
    },
    "安江": {
      "name": "安江",
      "stcd": "61301200",
      "z": 154.03,
      "q": null,
      "bjj": -8.97,
      "wrz": 163.0,
      "wptn": "6",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-09-15 08:40:00",
      "adnm": "洪江市"
    },
    "城陵矶(七里山)": {
      "name": "城陵矶(七里山)",
      "stcd": "61512000",
      "z": 23.9,
      "q": 6480.0,
      "bjj": -9.1,
      "wrz": 33.0,
      "wptn": "4",
      "hnnm": "洞庭湖",
      "rvnm": "洞庭湖湖口",
      "tm": "2026-09-15 08:00:00",
      "adnm": "岳阳楼区"
    },
    "辰溪": {
      "name": "辰溪",
      "stcd": "61301500",
      "z": 110.75,
      "q": null,
      "bjj": -9.25,
      "wrz": 120.0,
      "wptn": "6",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-09-15 08:00:00",
      "adnm": "辰溪县"
    },
    "桃源": {
      "name": "桃源",
      "stcd": "61302800",
      "z": 32.18,
      "q": null,
      "bjj": -10.32,
      "wrz": 42.5,
      "wptn": "4",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-09-15 08:40:00",
      "adnm": "桃源县"
    },
    "浦市(二)": {
      "name": "浦市(二)",
      "stcd": "61301600",
      "z": 108.73,
      "q": null,
      "bjj": -10.73,
      "wrz": 119.46,
      "wptn": "6",
      "hnnm": "沅江",
      "rvnm": "沅江",
      "tm": "2026-09-15 08:40:00",
      "adnm": "泸溪县"
    },
    "津市(二)": {
      "name": "津市(二)",
      "stcd": "61401300",
      "z": 29.78,
      "q": null,
      "bjj": -11.22,
      "wrz": 41.0,
      "wptn": "5",
      "hnnm": "澧水",
      "rvnm": "澧水",
      "tm": "2026-09-15 08:20:00",
      "adnm": "津市市"
    }
  },
  "basins": {
    "湘江": {
      "avg_bjj": -5.13,
      "stations": [
        {
          "name": "老埠头",
          "z": 99.93,
          "q": 1020.0,
          "bjj": -3.07,
          "wptn": "6"
        },
        {
          "name": "衡阳",
          "z": 52.66,
          "q": null,
          "bjj": -3.84,
          "wptn": null
        },
        {
          "name": "长沙(三)",
          "z": 31.93,
          "q": null,
          "bjj": -4.07,
          "wptn": "5"
        },
        {
          "name": "归阳",
          "z": 40.65,
          "q": null,
          "bjj": -4.85,
          "wptn": null
        },
        {
          "name": "湘潭",
          "z": 32.01,
          "q": 2530.0,
          "bjj": -5.99,
          "wptn": "6"
        },
        {
          "name": "衡山(二)",
          "z": 42.7,
          "q": null,
          "bjj": -6.3,
          "wptn": null
        },
        {
          "name": "株洲",
          "z": 32.2,
          "q": 2140.0,
          "bjj": -7.8,
          "wptn": "6"
        }
      ],
      "station_count": 7
    },
    "沅江": {
      "avg_bjj": -8.56,
      "stations": [
        {
          "name": "黔城",
          "z": 189.45,
          "q": null,
          "bjj": -3.55,
          "wptn": "6"
        },
        {
          "name": "安江",
          "z": 154.03,
          "q": null,
          "bjj": -8.97,
          "wptn": "6"
        },
        {
          "name": "辰溪",
          "z": 110.75,
          "q": null,
          "bjj": -9.25,
          "wptn": "6"
        },
        {
          "name": "桃源",
          "z": 32.18,
          "q": null,
          "bjj": -10.32,
          "wptn": "4"
        },
        {
          "name": "浦市(二)",
          "z": 108.73,
          "q": null,
          "bjj": -10.73,
          "wptn": "6"
        }
      ],
      "station_count": 5
    },
    "资水": {
      "avg_bjj": -4.99,
      "stations": [
        {
          "name": "邵阳",
          "z": 209.64,
          "q": null,
          "bjj": -4.36,
          "wptn": "5"
        },
        {
          "name": "新化",
          "z": 165.37,
          "q": 1560.0,
          "bjj": -4.85,
          "wptn": "4"
        },
        {
          "name": "桃江(二)",
          "z": 33.43,
          "q": null,
          "bjj": -5.77,
          "wptn": "5"
        }
      ],
      "station_count": 3
    },
    "洞庭湖": {
      "avg_bjj": -6.72,
      "stations": [
        {
          "name": "沅江(二)",
          "z": 28.58,
          "q": null,
          "bjj": -4.92,
          "wptn": "6"
        },
        {
          "name": "小河咀",
          "z": 28.54,
          "q": 1430.0,
          "bjj": -5.46,
          "wptn": "5"
        },
        {
          "name": "南咀",
          "z": 28.43,
          "q": 613.0,
          "bjj": -5.57,
          "wptn": "6"
        },
        {
          "name": "岳阳",
          "z": 23.93,
          "q": null,
          "bjj": -8.57,
          "wptn": "4"
        },
        {
          "name": "城陵矶(七里山)",
          "z": 23.9,
          "q": 6480.0,
          "bjj": -9.1,
          "wptn": "4"
        }
      ],
      "station_count": 5
    },
    "澧水": {
      "avg_bjj": -8.44,
      "stations": [
        {
          "name": "张家界",
          "z": 156.74,
          "q": 40.0,
          "bjj": -6.26,
          "wptn": "6"
        },
        {
          "name": "石门",
          "z": 50.66,
          "q": 135.0,
          "bjj": -7.84,
          "wptn": "6"
        },
        {
          "name": "津市(二)",
          "z": 29.78,
          "q": null,
          "bjj": -11.22,
          "wptn": "5"
        }
      ],
      "station_count": 3
    }
  }
};
